matthewzhenggong/Firmware/src/drivers/boards/px4-stm32f4discovery/px4discovery_led.c
/****************************************************************************
 *
 *   Copyright (c) 2013 PX4 Development Team. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name PX4 nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/**
 * @file px4discovery_led.c
 *
 * PX4-stm32f4discovery LED backend.
 */

#include <px4_config.h>

#include <stdbool.h>

#include "stm32.h"
#include "board_config.h"

#include <arch/board/board.h>

/*
 * Ideally we'd be able to get these from up_internal.h,
 * but since we want to be able to disable the NuttX use
 * of leds for system indication at will and there is no
 * separate switch, we need to build independent of the
 * CONFIG_ARCH_LEDS configuration switch.
 */
__BEGIN_DECLS
extern void led_init(void);
extern void led_on(int led);
extern void led_off(int led);
extern void led_toggle(int led);
__END_DECLS

__EXPORT void led_init()
{
	/* Configure LED1 GPIO for output */

	px4_arch_configgpio(GPIO_LED1);
	px4_arch_configgpio(GPIO_LED2);
	px4_arch_configgpio(GPIO_LED3);
	px4_arch_configgpio(GPIO_LED4);
}

__EXPORT void led_on(int led)
{
	switch (led) {
        case 1:
		/* Pull down to switch on */
		px4_arch_gpiowrite(GPIO_LED1, false);
                break;
        case 2:
		/* Pull down to switch on */
		px4_arch_gpiowrite(GPIO_LED2, false);
                break;
        case 3:
		/* Pull down to switch on */
		px4_arch_gpiowrite(GPIO_LED3, false);
                break;
        case 4:
		/* Pull down to switch on */
		px4_arch_gpiowrite(GPIO_LED4, false);
                break;
        default: 
                break;
	}
}

__EXPORT void led_off(int led)
{
	switch (led) {
        case 1:
		/* Pull down to switch off */
		px4_arch_gpiowrite(GPIO_LED1, true);
                break;
        case 2:
		/* Pull down to switch off */
		px4_arch_gpiowrite(GPIO_LED2, true);
                break;
        case 3:
		/* Pull down to switch off */
		px4_arch_gpiowrite(GPIO_LED3, true);
                break;
        case 4:
		/* Pull down to switch off */
		px4_arch_gpiowrite(GPIO_LED4, true);
                break;
        default: 
                break;
	}
}

__EXPORT void led_toggle(int led)
{
	switch (led) {
        case 1:
		if (px4_arch_gpioread(GPIO_LED1)) {
			px4_arch_gpiowrite(GPIO_LED1, false);

		} else {
			px4_arch_gpiowrite(GPIO_LED1, true);
		}
		break;
        case 2:
		if (px4_arch_gpioread(GPIO_LED2)) {
			px4_arch_gpiowrite(GPIO_LED2, false);

		} else {
			px4_arch_gpiowrite(GPIO_LED2, true);
		}
		break;
        case 3:
		if (px4_arch_gpioread(GPIO_LED3)) {
			px4_arch_gpiowrite(GPIO_LED3, false);

		} else {
			px4_arch_gpiowrite(GPIO_LED3, true);
		}
		break;
        case 4:
		if (px4_arch_gpioread(GPIO_LED4)) {
			px4_arch_gpiowrite(GPIO_LED4, false);

		} else {
			px4_arch_gpiowrite(GPIO_LED4, true);
		}
		break;
	default:
		break;
	}
}
